InformationRegisters/ВодителиПоМаршруту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВодителиПоМаршруту</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
						<v8:Type>cfg:CatalogRef.МаршрутыТранспортныхКомпаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Автомобили</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тоннаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вместимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДГлонасс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ВодителиПоМаршруту/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьПеревозчикаМаршрута(мМаршрут)
	
	Возврат мМаршрут.Перевозчик;
	
КонецФункции

Процедура ЗаполнитьВодителяПоАвтомобилю()
	
	Если Запись.Водитель.Пустая() Тогда
		Запись.Водитель = Запись.Автомобиль.ОсновнойВодитель;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура МаршрутПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Маршрут) Тогда
		Запись.Контрагент = ПолучитьПеревозчикаМаршрута(Запись.Маршрут);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	
	ЗаполнитьВодителяПоАвтомобилю();
	
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//
	ФормаВыбора = ПолучитьФорму("Справочник.Автомобили.Форма.ФормаВыбора",, Элемент);
	
	Если НЕ Запись.Автомобиль.Пустая() Тогда
		ФормаВыбора.Элементы.Список.ТекущаяСтрока = Запись.Автомобиль;
	КонецЕсли;

	Если НЕ Запись.Контрагент.Пустая() Тогда
		мСписок = ФормаВыбора.Список;
		ЭлементОтбора = мСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Перевозчик");   
	    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование  = Истина;
	    ЭлементОтбора.ПравоеЗначение = Запись.Контрагент;
	    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
    //
	ФормаВыбора = ПолучитьФорму("Справочник.КонтактныеЛицаКонтрагентов.ФормаВыбора",, Элемент);
	
	Если ТипЗнч(ФормаВыбора) = Тип("УправляемаяФорма") Тогда
		Если НЕ Запись.Водитель.Пустая() Тогда
			ФормаВыбора.Элементы.Список.ТекущаяСтрока = Запись.Водитель;
		КонецЕсли;

		Если НЕ Запись.Контрагент.Пустая() Тогда
			мСписок = ФормаВыбора.Список;
			ЭлементОтбора = мСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Владелец");   
		    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		    ЭлементОтбора.Использование  = Истина;
		    ЭлементОтбора.ПравоеЗначение = Запись.Контрагент;
		    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		КонецЕсли;
	Иначе
		ФормаВыбора.НачальноеЗначениеВыбора = Запись.Водитель;
	
		Если НЕ Запись.Контрагент.Пустая() Тогда
			ФормаВыбора.Отбор.Владелец.Установить(Запись.Контрагент);
			ФормаВыбора.ЭлементыФормы.СправочникСписок.НастройкаОтбора.Владелец.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры
